{"backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Model", "config": {"name": "model_1", "output_layers": [["activation_34", 0, 0]], "layers": [{"name": "inputs", "inbound_nodes": [], "config": {"batch_input_shape": [null, 512, 512, 12], "dtype": "float32", "sparse": false, "name": "inputs"}, "class_name": "InputLayer"}, {"name": "conv2d_1", "inbound_nodes": [[["inputs", 0, 0, {}]]], "config": {"trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "name": "conv2d_1", "kernel_regularizer": null, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_1", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true}, "class_name": "BatchNormalization"}, {"name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "name": "conv2d_2", "kernel_regularizer": null, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_2", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true}, "class_name": "BatchNormalization"}, {"name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"name": "dropout_1", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "rate": 0.5, "seed": null}, "class_name": "Dropout"}, {"name": "max_pooling2d_1", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"trainable": true, "strides": [1, 1], "name": "max_pooling2d_1", "padding": "valid", "pool_size": [1, 1], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"name": "conv2d_3", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "name": "conv2d_3", "kernel_regularizer": null, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "add_1", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["conv2d_3", 0, 0, {}]]], "config": {"trainable": true, "name": "add_1"}, "class_name": "Add"}, {"name": "batch_normalization_3", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_3", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true}, "class_name": "BatchNormalization"}, {"name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_4", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [2, 2], "bias_constraint": null, "name": "conv2d_4", "kernel_regularizer": null, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_4", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true}, "class_name": "BatchNormalization"}, {"name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"name": "dropout_2", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"trainable": true, "noise_shape": null, "name": "dropout_2", "rate": 0.5, "seed": null}, "class_name": "Dropout"}, {"name": "max_pooling2d_2", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"name": "conv2d_5", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "name": "conv2d_5", "kernel_regularizer": null, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "add_2", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}], ["conv2d_5", 0, 0, {}]]], "config": {"trainable": true, "name": "add_2"}, "class_name": "Add"}, {"name": "batch_normalization_5", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_5", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true}, "class_name": "BatchNormalization"}, {"name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_6", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "name": "conv2d_6", "kernel_regularizer": null, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_6", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true}, "class_name": "BatchNormalization"}, {"name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "class_name": "Activation"}, {"name": "dropout_3", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"trainable": true, "noise_shape": null, "name": "dropout_3", "rate": 0.5, "seed": null}, "class_name": "Dropout"}, {"name": "max_pooling2d_3", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"trainable": true, "strides": [1, 1], "name": "max_pooling2d_3", "padding": "valid", "pool_size": [1, 1], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"name": "conv2d_7", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "config": {"trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "name": "conv2d_7", "kernel_regularizer": null, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "add_3", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}], ["conv2d_7", 0, 0, {}]]], "config": {"trainable": true, "name": "add_3"}, "class_name": "Add"}, {"name": "batch_normalization_7", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_7", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true}, "class_name": "BatchNormalization"}, {"name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_7", "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [2, 2], "bias_constraint": null, "name": "conv2d_8", "kernel_regularizer": null, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_8", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true}, "class_name": "BatchNormalization"}, {"name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_8", "activation": "relu"}, "class_name": "Activation"}, {"name": "dropout_4", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"trainable": true, "noise_shape": null, "name": "dropout_4", "rate": 0.5, "seed": null}, "class_name": "Dropout"}, {"name": "max_pooling2d_4", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_4", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"name": "conv2d_9", "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "config": {"trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "name": "conv2d_9", "kernel_regularizer": null, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "add_4", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}], ["conv2d_9", 0, 0, {}]]], "config": {"trainable": true, "name": "add_4"}, "class_name": "Add"}, {"name": "batch_normalization_9", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_9", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true}, "class_name": "BatchNormalization"}, {"name": "activation_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_9", "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "name": "conv2d_10", "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_10", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true}, "class_name": "BatchNormalization"}, {"name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_10", "activation": "relu"}, "class_name": "Activation"}, {"name": "max_pooling2d_5", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"trainable": true, "strides": [1, 1], "name": "max_pooling2d_5", "padding": "valid", "pool_size": [1, 1], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"name": "dropout_5", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"trainable": true, "noise_shape": null, "name": "dropout_5", "rate": 0.5, "seed": null}, "class_name": "Dropout"}, {"name": "lambda_1", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "config": {"function": ["4wEAAAAAAAAAAgAAAAQAAABTAAAAcygAAAB0AABqAQB8AACDAQB9AQB0AABqAgB8AAB8AQBnAgBk\nAQBkAgCDAQFTKQNO2gRheGlz6QMAAAApA9oBS9oKemVyb3NfbGlrZdoLY29uY2F0ZW5hdGUpAtoB\neNoBeakAcggAAAD6PC9tZWRpYS91dXNlci9kYXRhLzk5NS1JQ1UgIHBsdXNlIGZldHVyZS9zcmMv\ncmVzM0RfbmV0d29yay5wedoHemVyb3BhZFgAAABzBAAAAAABDwE=\n", null, null], "trainable": true, "function_type": "lambda", "output_shape_type": "lambda", "name": "lambda_1", "arguments": {}, "output_shape": ["4wEAAAAAAAAAAgAAAAQAAABTAAAAczwAAAB0AAB8AACDAQB9AQB0AQB8AQCDAQBkAQBrAgBzJAB0\nAgCCAQB8AQBkAgAFGWQDADkDPHQDAHwBAIMBAFMpBE7pBAAAAOkDAAAA6QIAAAApBNoEbGlzdNoD\nbGVu2g5Bc3NlcnRpb25FcnJvctoFdHVwbGUpAtoLaW5wdXRfc2hhcGXaBXNoYXBlqQByCgAAAPo8\nL21lZGlhL3V1c2VyL2RhdGEvOTk1LUlDVSAgcGx1c2UgZmV0dXJlL3NyYy9yZXMzRF9uZXR3b3Jr\nLnB52hR6ZXJvcGFkX291dHB1dF9zaGFwZVwAAABzCAAAAAABDAEYAQ4B\n", null, null]}, "class_name": "Lambda"}, {"name": "conv2d_11", "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "config": {"trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "name": "conv2d_11", "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "add_5", "inbound_nodes": [[["lambda_1", 0, 0, {}], ["conv2d_11", 0, 0, {}]]], "config": {"trainable": true, "name": "add_5"}, "class_name": "Add"}, {"name": "batch_normalization_11", "inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_11", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true}, "class_name": "BatchNormalization"}, {"name": "activation_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_11", "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_12", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "config": {"trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "name": "conv2d_12", "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_12", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true}, "class_name": "BatchNormalization"}, {"name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_12", "activation": "relu"}, "class_name": "Activation"}, {"name": "dropout_6", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "config": {"trainable": true, "noise_shape": null, "name": "dropout_6", "rate": 0.5, "seed": null}, "class_name": "Dropout"}, {"name": "max_pooling2d_6", "inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"trainable": true, "strides": [1, 1], "name": "max_pooling2d_6", "padding": "valid", "pool_size": [1, 1], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"name": "conv2d_13", "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "config": {"trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "name": "conv2d_13", "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "add_6", "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}], ["conv2d_13", 0, 0, {}]]], "config": {"trainable": true, "name": "add_6"}, "class_name": "Add"}, {"name": "batch_normalization_13", "inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_13", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true}, "class_name": "BatchNormalization"}, {"name": "activation_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_13", "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_14", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "config": {"trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "name": "conv2d_14", "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "batch_normalization_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_14", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true}, "class_name": "BatchNormalization"}, {"name": "activation_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_14", "activation": "relu"}, "class_name": "Activation"}, {"name": "dropout_7", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "config": {"trainable": true, "noise_shape": null, "name": "dropout_7", "rate": 0.5, "seed": null}, "class_name": "Dropout"}, {"name": "max_pooling2d_7", "inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"trainable": true, "strides": [1, 1], "name": "max_pooling2d_7", "padding": "valid", "pool_size": [1, 1], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"name": "conv2d_15", "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "config": {"trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "name": "conv2d_15", "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "add_7", "inbound_nodes": [[["max_pooling2d_7", 0, 0, {}], ["conv2d_15", 0, 0, {}]]], "config": {"trainable": true, "name": "add_7"}, "class_name": "Add"}, {"name": "batch_normalization_15", "inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_15", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true}, "class_name": "BatchNormalization"}, {"name": "activation_15", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_15", "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_16", "inbound_nodes": [[["activation_15", 0, 0, {}]]], "config": {"trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [2, 2], "bias_constraint": null, "name": "conv2d_16", "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "batch_normalization_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_16", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true}, "class_name": "BatchNormalization"}, {"name": "activation_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_16", "activation": "relu"}, "class_name": "Activation"}, {"name": "dropout_8", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "config": {"trainable": true, "noise_shape": null, "name": "dropout_8", "rate": 0.5, "seed": null}, "class_name": "Dropout"}, {"name": "max_pooling2d_8", "inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_8", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"name": "conv2d_17", "inbound_nodes": [[["dropout_8", 0, 0, {}]]], "config": {"trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "name": "conv2d_17", "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "add_8", "inbound_nodes": [[["max_pooling2d_8", 0, 0, {}], ["conv2d_17", 0, 0, {}]]], "config": {"trainable": true, "name": "add_8"}, "class_name": "Add"}, {"name": "batch_normalization_17", "inbound_nodes": [[["add_8", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_17", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true}, "class_name": "BatchNormalization"}, {"name": "activation_17", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_17", "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_18", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "config": {"trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "name": "conv2d_18", "kernel_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "batch_normalization_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_18", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true}, "class_name": "BatchNormalization"}, {"name": "activation_18", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_18", "activation": "relu"}, "class_name": "Activation"}, {"name": "max_pooling2d_9", "inbound_nodes": [[["add_8", 0, 0, {}]]], "config": {"trainable": true, "strides": [1, 1], "name": "max_pooling2d_9", "padding": "valid", "pool_size": [1, 1], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"name": "dropout_9", "inbound_nodes": [[["activation_18", 0, 0, {}]]], "config": {"trainable": true, "noise_shape": null, "name": "dropout_9", "rate": 0.5, "seed": null}, "class_name": "Dropout"}, {"name": "lambda_2", "inbound_nodes": [[["max_pooling2d_9", 0, 0, {}]]], "config": {"function": ["4wEAAAAAAAAAAgAAAAQAAABTAAAAcygAAAB0AABqAQB8AACDAQB9AQB0AABqAgB8AAB8AQBnAgBk\nAQBkAgCDAQFTKQNO2gRheGlz6QMAAAApA9oBS9oKemVyb3NfbGlrZdoLY29uY2F0ZW5hdGUpAtoB\neNoBeakAcggAAAD6PC9tZWRpYS91dXNlci9kYXRhLzk5NS1JQ1UgIHBsdXNlIGZldHVyZS9zcmMv\ncmVzM0RfbmV0d29yay5wedoHemVyb3BhZFgAAABzBAAAAAABDwE=\n", null, null], "trainable": true, "function_type": "lambda", "output_shape_type": "lambda", "name": "lambda_2", "arguments": {}, "output_shape": ["4wEAAAAAAAAAAgAAAAQAAABTAAAAczwAAAB0AAB8AACDAQB9AQB0AQB8AQCDAQBkAQBrAgBzJAB0\nAgCCAQB8AQBkAgAFGWQDADkDPHQDAHwBAIMBAFMpBE7pBAAAAOkDAAAA6QIAAAApBNoEbGlzdNoD\nbGVu2g5Bc3NlcnRpb25FcnJvctoFdHVwbGUpAtoLaW5wdXRfc2hhcGXaBXNoYXBlqQByCgAAAPo8\nL21lZGlhL3V1c2VyL2RhdGEvOTk1LUlDVSAgcGx1c2UgZmV0dXJlL3NyYy9yZXMzRF9uZXR3b3Jr\nLnB52hR6ZXJvcGFkX291dHB1dF9zaGFwZVwAAABzCAAAAAABDAEYAQ4B\n", null, null]}, "class_name": "Lambda"}, {"name": "conv2d_19", "inbound_nodes": [[["dropout_9", 0, 0, {}]]], "config": {"trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "name": "conv2d_19", "kernel_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "add_9", "inbound_nodes": [[["lambda_2", 0, 0, {}], ["conv2d_19", 0, 0, {}]]], "config": {"trainable": true, "name": "add_9"}, "class_name": "Add"}, {"name": "batch_normalization_19", "inbound_nodes": [[["add_9", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_19", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true}, "class_name": "BatchNormalization"}, {"name": "activation_19", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_19", "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_20", "inbound_nodes": [[["activation_19", 0, 0, {}]]], "config": {"trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "name": "conv2d_20", "kernel_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "batch_normalization_20", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_20", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true}, "class_name": "BatchNormalization"}, {"name": "activation_20", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_20", "activation": "relu"}, "class_name": "Activation"}, {"name": "dropout_10", "inbound_nodes": [[["activation_20", 0, 0, {}]]], "config": {"trainable": true, "noise_shape": null, "name": "dropout_10", "rate": 0.5, "seed": null}, "class_name": "Dropout"}, {"name": "max_pooling2d_10", "inbound_nodes": [[["add_9", 0, 0, {}]]], "config": {"trainable": true, "strides": [1, 1], "name": "max_pooling2d_10", "padding": "valid", "pool_size": [1, 1], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"name": "conv2d_21", "inbound_nodes": [[["dropout_10", 0, 0, {}]]], "config": {"trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "name": "conv2d_21", "kernel_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "add_10", "inbound_nodes": [[["max_pooling2d_10", 0, 0, {}], ["conv2d_21", 0, 0, {}]]], "config": {"trainable": true, "name": "add_10"}, "class_name": "Add"}, {"name": "batch_normalization_21", "inbound_nodes": [[["add_10", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_21", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true}, "class_name": "BatchNormalization"}, {"name": "activation_21", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_21", "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_22", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "config": {"trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "name": "conv2d_22", "kernel_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "batch_normalization_22", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_22", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true}, "class_name": "BatchNormalization"}, {"name": "activation_22", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_22", "activation": "relu"}, "class_name": "Activation"}, {"name": "dropout_11", "inbound_nodes": [[["activation_22", 0, 0, {}]]], "config": {"trainable": true, "noise_shape": null, "name": "dropout_11", "rate": 0.5, "seed": null}, "class_name": "Dropout"}, {"name": "max_pooling2d_11", "inbound_nodes": [[["add_10", 0, 0, {}]]], "config": {"trainable": true, "strides": [1, 1], "name": "max_pooling2d_11", "padding": "valid", "pool_size": [1, 1], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"name": "conv2d_23", "inbound_nodes": [[["dropout_11", 0, 0, {}]]], "config": {"trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "name": "conv2d_23", "kernel_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "add_11", "inbound_nodes": [[["max_pooling2d_11", 0, 0, {}], ["conv2d_23", 0, 0, {}]]], "config": {"trainable": true, "name": "add_11"}, "class_name": "Add"}, {"name": "batch_normalization_23", "inbound_nodes": [[["add_11", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_23", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true}, "class_name": "BatchNormalization"}, {"name": "activation_23", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_23", "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_24", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "config": {"trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [2, 2], "bias_constraint": null, "name": "conv2d_24", "kernel_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "batch_normalization_24", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_24", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true}, "class_name": "BatchNormalization"}, {"name": "activation_24", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_24", "activation": "relu"}, "class_name": "Activation"}, {"name": "dropout_12", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "config": {"trainable": true, "noise_shape": null, "name": "dropout_12", "rate": 0.5, "seed": null}, "class_name": "Dropout"}, {"name": "max_pooling2d_12", "inbound_nodes": [[["add_11", 0, 0, {}]]], "config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_12", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"name": "conv2d_25", "inbound_nodes": [[["dropout_12", 0, 0, {}]]], "config": {"trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "name": "conv2d_25", "kernel_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "add_12", "inbound_nodes": [[["max_pooling2d_12", 0, 0, {}], ["conv2d_25", 0, 0, {}]]], "config": {"trainable": true, "name": "add_12"}, "class_name": "Add"}, {"name": "batch_normalization_25", "inbound_nodes": [[["add_12", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_25", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true}, "class_name": "BatchNormalization"}, {"name": "activation_25", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_25", "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_26", "inbound_nodes": [[["activation_25", 0, 0, {}]]], "config": {"trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "name": "conv2d_26", "kernel_regularizer": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "batch_normalization_26", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_26", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true}, "class_name": "BatchNormalization"}, {"name": "activation_26", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_26", "activation": "relu"}, "class_name": "Activation"}, {"name": "max_pooling2d_13", "inbound_nodes": [[["add_12", 0, 0, {}]]], "config": {"trainable": true, "strides": [1, 1], "name": "max_pooling2d_13", "padding": "valid", "pool_size": [1, 1], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"name": "dropout_13", "inbound_nodes": [[["activation_26", 0, 0, {}]]], "config": {"trainable": true, "noise_shape": null, "name": "dropout_13", "rate": 0.5, "seed": null}, "class_name": "Dropout"}, {"name": "lambda_3", "inbound_nodes": [[["max_pooling2d_13", 0, 0, {}]]], "config": {"function": ["4wEAAAAAAAAAAgAAAAQAAABTAAAAcygAAAB0AABqAQB8AACDAQB9AQB0AABqAgB8AAB8AQBnAgBk\nAQBkAgCDAQFTKQNO2gRheGlz6QMAAAApA9oBS9oKemVyb3NfbGlrZdoLY29uY2F0ZW5hdGUpAtoB\neNoBeakAcggAAAD6PC9tZWRpYS91dXNlci9kYXRhLzk5NS1JQ1UgIHBsdXNlIGZldHVyZS9zcmMv\ncmVzM0RfbmV0d29yay5wedoHemVyb3BhZFgAAABzBAAAAAABDwE=\n", null, null], "trainable": true, "function_type": "lambda", "output_shape_type": "lambda", "name": "lambda_3", "arguments": {}, "output_shape": ["4wEAAAAAAAAAAgAAAAQAAABTAAAAczwAAAB0AAB8AACDAQB9AQB0AQB8AQCDAQBkAQBrAgBzJAB0\nAgCCAQB8AQBkAgAFGWQDADkDPHQDAHwBAIMBAFMpBE7pBAAAAOkDAAAA6QIAAAApBNoEbGlzdNoD\nbGVu2g5Bc3NlcnRpb25FcnJvctoFdHVwbGUpAtoLaW5wdXRfc2hhcGXaBXNoYXBlqQByCgAAAPo8\nL21lZGlhL3V1c2VyL2RhdGEvOTk1LUlDVSAgcGx1c2UgZmV0dXJlL3NyYy9yZXMzRF9uZXR3b3Jr\nLnB52hR6ZXJvcGFkX291dHB1dF9zaGFwZVwAAABzCAAAAAABDAEYAQ4B\n", null, null]}, "class_name": "Lambda"}, {"name": "conv2d_27", "inbound_nodes": [[["dropout_13", 0, 0, {}]]], "config": {"trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "name": "conv2d_27", "kernel_regularizer": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "add_13", "inbound_nodes": [[["lambda_3", 0, 0, {}], ["conv2d_27", 0, 0, {}]]], "config": {"trainable": true, "name": "add_13"}, "class_name": "Add"}, {"name": "batch_normalization_27", "inbound_nodes": [[["add_13", 0, 0, {}]]], "config": 