{"class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "name": "inputs", "config": {"batch_input_shape": [null, 4096, 12], "dtype": "float32", "sparse": false, "name": "inputs"}, "inbound_nodes": []}, {"class_name": "SeparableConv1D", "name": "separable_conv1d_1", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "trainable": true, "name": "separable_conv1d_1", "filters": 32, "padding": "same", "dilation_rate": [1], "strides": [1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "kernel_size": [16], "depthwise_constraint": null, "pointwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["inputs", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "name": "separable_conv1d_2", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "trainable": true, "name": "separable_conv1d_2", "filters": 32, "padding": "same", "dilation_rate": [1], "strides": [1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "kernel_size": [32], "depthwise_constraint": null, "pointwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["inputs", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_1", "config": {"axis": 2, "trainable": true, "name": "concatenate_1"}, "inbound_nodes": [[["separable_conv1d_1", 0, 0, {}], ["separable_conv1d_2", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "name": "separable_conv1d_3", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "trainable": true, "name": "separable_conv1d_3", "filters": 32, "padding": "same", "dilation_rate": [1], "strides": [1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "kernel_size": [1], "depthwise_constraint": null, "pointwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_1", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["separable_conv1d_3", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_1", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_2", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_2", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "name": "separable_conv1d_4", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "trainable": true, "name": "separable_conv1d_4", "filters": 32, "padding": "same", "dilation_rate": [1], "strides": [1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "kernel_size": [16], "depthwise_constraint": null, "pointwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "name": "separable_conv1d_5", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "trainable": true, "name": "separable_conv1d_5", "filters": 32, "padding": "same", "dilation_rate": [1], "strides": [1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "kernel_size": [32], "depthwise_constraint": null, "pointwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_2", "config": {"axis": 2, "trainable": true, "name": "concatenate_2"}, "inbound_nodes": [[["separable_conv1d_4", 0, 0, {}], ["separable_conv1d_5", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "name": "separable_conv1d_6", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "trainable": true, "name": "separable_conv1d_6", "filters": 32, "padding": "same", "dilation_rate": [1], "strides": [1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "kernel_size": [1], "depthwise_constraint": null, "pointwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_3", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["separable_conv1d_6", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_3", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_4", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_4", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"seed": null, "trainable": true, "name": "dropout_1", "noise_shape": null, "rate": 0.3}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "name": "separable_conv1d_7", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "trainable": true, "name": "separable_conv1d_7", "filters": 32, "padding": "same", "dilation_rate": [1], "strides": [1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "kernel_size": [16], "depthwise_constraint": null, "pointwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "name": "separable_conv1d_8", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "trainable": true, "name": "separable_conv1d_8", "filters": 32, "padding": "same", "dilation_rate": [1], "strides": [1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "kernel_size": [32], "depthwise_constraint": null, "pointwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_3", "config": {"axis": 2, "trainable": true, "name": "concatenate_3"}, "inbound_nodes": [[["separable_conv1d_7", 0, 0, {}], ["separable_conv1d_8", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "name": "separable_conv1d_9", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "trainable": true, "name": "separable_conv1d_9", "filters": 32, "padding": "same", "dilation_rate": [1], "strides": [1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "kernel_size": [1], "depthwise_constraint": null, "pointwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_5", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["separable_conv1d_9", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "name": "max_pooling1d_1", "config": {"pool_size": [1], "strides": [1], "trainable": true, "name": "max_pooling1d_1", "data_format": "channels_last", "padding": "valid"}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_5", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_1", "config": {"trainable": true, "name": "add_1"}, "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}], ["activation_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_6", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_6", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "name": "separable_conv1d_10", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "trainable": true, "name": "separable_conv1d_10", "filters": 32, "padding": "same", "dilation_rate": [1], "strides": [2], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "kernel_size": [16], "depthwise_constraint": null, "pointwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "name": "separable_conv1d_11", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "trainable": true, "name": "separable_conv1d_11", "filters": 32, "padding": "same", "dilation_rate": [1], "strides": [2], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "kernel_size": [32], "depthwise_constraint": null, "pointwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_4", "config": {"axis": 2, "trainable": true, "name": "concatenate_4"}, "inbound_nodes": [[["separable_conv1d_10", 0, 0, {}], ["separable_conv1d_11", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "name": "separable_conv1d_12", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "trainable": true, "name": "separable_conv1d_12", "filters": 32, "padding": "same", "dilation_rate": [1], "strides": [1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "kernel_size": [2], "depthwise_constraint": null, "pointwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_7", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["separable_conv1d_12", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_7", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_8", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_8", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_2", "config": {"seed": null, "trainable": true, "name": "dropout_2", "noise_shape": null, "rate": 0.3}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "name": "separable_conv1d_13", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "trainable": true, "name": "separable_conv1d_13", "filters": 32, "padding": "same", "dilation_rate": [1], "strides": [1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "kernel_size": [16], "depthwise_constraint": null, "pointwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "name": "separable_conv1d_14", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "trainable": true, "name": "separable_conv1d_14", "filters": 32, "padding": "same", "dilation_rate": [1], "strides": [1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "kernel_size": [32], "depthwise_constraint": null, "pointwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_5", "config": {"axis": 2, "trainable": true, "name": "concatenate_5"}, "inbound_nodes": [[["separable_conv1d_13", 0, 0, {}], ["separable_conv1d_14", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "name": "separable_conv1d_15", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "trainable": true, "name": "separable_conv1d_15", "filters": 32, "padding": "same", "dilation_rate": [1], "strides": [1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "kernel_size": [1], "depthwise_constraint": null, "pointwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["concatenate_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_9", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_9", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["separable_conv1d_15", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "name": "max_pooling1d_2", "config": {"pool_size": [2], "strides": [2], "trainable": true, "name": "max_pooling1d_2", "data_format": "channels_last", "padding": "valid"}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_9", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_2", "config": {"trainable": true, "name": "add_2"}, "inbound_nodes": [[["max_pooling1d_2", 0, 0, {}], ["activation_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_10", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_10", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_10", "config": {"activation": "relu", "trainable": true, "name": "activation_10"}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "name": "separable_conv1d_16", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "trainable": true, "name": "separable_conv1d_16", "filters": 32, "padding": "same", "dilation_rate": [1], "strides": [1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "kernel_size": [16], "depthwise_constraint": null, "pointwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "name": "separable_conv1d_17", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "trainable": true, "name": "separable_conv1d_17", "filters": 32, "padding": "same", "dilation_rate": [1], "strides": [1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "kernel_size": [32], "depthwise_constraint": null, "pointwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_6", "config": {"axis": 2, "trainable": true, "name": "concatenate_6"}, "inbound_nodes": [[["separable_conv1d_16", 0, 0, {}], ["separable_conv1d_17", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "name": "separable_conv1d_18", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "trainable": true, "name": "separable_conv1d_18", "filters": 32, "padding": "same", "dilation_rate": [1], "strides": [1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "kernel_size": [1], "depthwise_constraint": null, "pointwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["concatenate_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_11", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_11", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["separable_conv1d_18", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_11", "config": {"activation": "relu", "trainable": true, "name": "activation_11"}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_12", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_12", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_12", "config": {"activation": "relu", "trainable": true, "name": "activation_12"}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_3", "config": {"seed": null, "trainable": true, "name": "dropout_3", "noise_shape": null, "rate": 0.3}, "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "name": "separable_conv1d_19", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "trainable": true, "name": "separable_conv1d_19", "filters": 32, "padding": "same", "dilation_rate": [1], "strides": [1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "kernel_size": [16], "depthwise_constraint": null, "pointwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "name": "separable_conv1d_20", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "trainable": true, "name": "separable_conv1d_20", "filters": 32, "padding": "same", "dilation_rate": [1], "strides": [1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "kernel_size": [32], "depthwise_constraint": null, "pointwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_7", "config": {"axis": 2, "trainable": true, "name": "concatenate_7"}, "inbound_nodes": [[["separable_conv1d_19", 0, 0, {}], ["separable_conv1d_20", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "name": "separable_conv1d_21", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "trainable": true, "name": "separable_conv1d_21", "filters": 32, "padding": "same", "dilation_rate": [1], "strides": [1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "kernel_size": [1], "depthwise_constraint": null, "pointwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["concatenate_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_13", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_13", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["separable_conv1d_21", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "name": "max_pooling1d_3", "config": {"pool_size": [1], "strides": [1], "trainable": true, "name": "max_pooling1d_3", "data_format": "channels_last", "padding": "valid"}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_13", "config": {"activation": "relu", "trainable": true, "name": "activation_13"}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_3", "config": {"trainable": true, "name": "add_3"}, "inbound_nodes": [[["max_pooling1d_3", 0, 0, {}], ["activation_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_14", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_14", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_14", "config": {"activation": "relu", "trainable": true, "name": "activation_14"}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "name": "separable_conv1d_22", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "trainable": true, "name": "separable_conv1d_22", "filters": 32, "padding": "same", "dilation_rate": [1], "strides": [2], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "kernel_size": [16], "depthwise_constraint": null, "pointwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "name": "separable_conv1d_23", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "trainable": true, "name": "separable_conv1d_23", "filters": 32, "padding": "same", "dilation_rate": [1], "strides": [2], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "kernel_size": [32], "depthwise_constraint": null, "pointwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_8", "config": {"axis": 2, "trainable": true, "name": "concatenate_8"}, "inbound_nodes": [[["separable_conv1d_22", 0, 0, {}], ["separable_conv1d_23", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "name": "separable_conv1d_24", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "trainable": true, "name": "separable_conv1d_24", "filters": 32, "padding": "same", "dilation_rate": [1], "strides": [1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "kernel_size": [2], "depthwise_constraint": null, "pointwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["concatenate_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_15", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_15", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["separable_conv1d_24", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_15", "config": {"activation": "relu", "trainable": true, "name": "activation_15"}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_16", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_16", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["activation_15", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_16", "config": {"activation": "relu", "trainable": true, "name": "activation_16"}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_4", "config": {"seed": null, "trainable": true, "name": "dropout_4", "noise_shape": null, "rate": 0.3}, "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "name": "separable_conv1d_25", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "trainable": true, "name": "separable_conv1d_25", "filters": 32, "padding": "same", "dilation_rate": [1], "strides": [1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "kernel_size": [16], "depthwise_constraint": null, "pointwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "name": "separable_conv1d_26", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "trainable": true, "name": "separable_conv1d_26", "filters": 32, "padding": "same", "dilation_rate": [1], "strides": [1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "kernel_size": [32], "depthwise_constraint": null, "pointwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_9", "config": {"axis": 2, "trainable": true, "name": "concatenate_9"}, "inbound_nodes": [[["separable_conv1d_25", 0, 0, {}], ["separable_conv1d_26", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "name": "separable_conv1d_27", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "trainable": true, "name": "separable_conv1d_27", "filters": 32, "padding": "same", "dilation_rate": [1], "strides": [1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "kernel_size": [1], "depthwise_constraint": null, "pointwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["concatenate_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_17", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_17", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["separable_conv1d_27", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "name": "max_pooling1d_4", "config": {"pool_size": [2], "strides": [2], "trainable": true, "name": "max_pooling1d_4", "data_format": "channels_last", "padding": "valid"}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_17", "config": {"activation": "relu", "trainable": true, "name": "activation_17"}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_4", "config": {"trainable": true, "name": "add_4"}, "inbound_nodes": [[["max_pooling1d_4", 0, 0, {}], ["activation_17", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_18", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_18", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_18", "config": {"activation": "relu", "trainable": true, "name": "activation_18"}, "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "name": "separable_conv1d_28", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "trainable": true, "name": "separable_conv1d_28", "filters": 64, "padding": "same", "dilation_rate": [1], "strides": [1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "kernel_size": [16], "depthwise_constraint": null, "pointwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["activation_18", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "name": "separable_conv1d_29", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "trainable": true, "name": "separable_conv1d_29", "filters": 64, "padding": "same", "dilation_rate": [1], "strides": [1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "kernel_size": [32], "depthwise_constraint": null, "pointwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["activation_18", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_10", "config": {"axis": 2, "trainable": true, "name": "concatenate_10"}, "inbound_nodes": [[["separable_conv1d_28", 0, 0, {}], ["separable_conv1d_29", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "name": "separable_conv1d_30", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "trainable": true, "name": "separable_conv1d_30", "filters": 64, "padding": "same", "dilation_rate": [1], "strides": [1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "kernel_size": [1], "depthwise_constraint": null, "pointwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["concatenate_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_19", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_19", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["separable_conv1d_30", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_19", "config": {"activation": "relu", "trainable": true, "name": "activation_19"}, "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_20", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_20", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["activation_19", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_20", "config": {"activation": "relu", "trainable": true, "name": "activation_20"}, "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_5", "config": {"seed": null, "trainable": true, "name": "dropout_5", "noise_shape": null, "rate": 0.3}, "inbound_nodes": [[["activation_20", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "name": "separable_conv1d_31", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "trainable": true, "name": "separable_conv1d_31", "filters": 64, "padding": "same", "dilation_rate": [1], "strides": [1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "kernel_size": [16], "depthwise_constraint": null, "pointwise_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "name": "separable_conv1d_32", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "trainable": true, "name": 