{"class_name": "Model", "config": {"input_layers": [["inputs", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 4096, 12], "name": "inputs", "sparse": false}, "name": "inputs", "inbound_nodes": []}, {"class_name": "SeparableConv1D", "config": {"padding": "same", "data_format": "channels_last", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1], "depthwise_regularizer": null, "depthwise_constraint": null, "trainable": true, "name": "separable_conv1d_1", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_regularizer": null, "kernel_size": [16], "dilation_rate": [1], "bias_regularizer": null, "activation": "linear", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "pointwise_constraint": null, "bias_constraint": null}, "name": "separable_conv1d_1", "inbound_nodes": [[["inputs", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "config": {"padding": "same", "data_format": "channels_last", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1], "depthwise_regularizer": null, "depthwise_constraint": null, "trainable": true, "name": "separable_conv1d_2", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_regularizer": null, "kernel_size": [32], "dilation_rate": [1], "bias_regularizer": null, "activation": "linear", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "pointwise_constraint": null, "bias_constraint": null}, "name": "separable_conv1d_2", "inbound_nodes": [[["inputs", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 2, "trainable": true, "name": "concatenate_1"}, "name": "concatenate_1", "inbound_nodes": [[["separable_conv1d_1", 0, 0, {}], ["separable_conv1d_2", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "config": {"padding": "same", "data_format": "channels_last", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1], "depthwise_regularizer": null, "depthwise_constraint": null, "trainable": true, "name": "separable_conv1d_3", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_regularizer": null, "kernel_size": [1], "dilation_rate": [1], "bias_regularizer": null, "activation": "linear", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "pointwise_constraint": null, "bias_constraint": null}, "name": "separable_conv1d_3", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "center": true, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": -1, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_1", "inbound_nodes": [[["separable_conv1d_3", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_1"}, "name": "leaky_re_lu_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "center": true, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": -1, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_2", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_2"}, "name": "leaky_re_lu_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "config": {"padding": "same", "data_format": "channels_last", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1], "depthwise_regularizer": null, "depthwise_constraint": null, "trainable": true, "name": "separable_conv1d_4", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_regularizer": null, "kernel_size": [16], "dilation_rate": [1], "bias_regularizer": null, "activation": "linear", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "pointwise_constraint": null, "bias_constraint": null}, "name": "separable_conv1d_4", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "config": {"padding": "same", "data_format": "channels_last", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1], "depthwise_regularizer": null, "depthwise_constraint": null, "trainable": true, "name": "separable_conv1d_5", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_regularizer": null, "kernel_size": [32], "dilation_rate": [1], "bias_regularizer": null, "activation": "linear", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "pointwise_constraint": null, "bias_constraint": null}, "name": "separable_conv1d_5", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 2, "trainable": true, "name": "concatenate_2"}, "name": "concatenate_2", "inbound_nodes": [[["separable_conv1d_4", 0, 0, {}], ["separable_conv1d_5", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "config": {"padding": "same", "data_format": "channels_last", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1], "depthwise_regularizer": null, "depthwise_constraint": null, "trainable": true, "name": "separable_conv1d_6", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_regularizer": null, "kernel_size": [1], "dilation_rate": [1], "bias_regularizer": null, "activation": "linear", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "pointwise_constraint": null, "bias_constraint": null}, "name": "separable_conv1d_6", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "center": true, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_3", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": -1, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_3", "inbound_nodes": [[["separable_conv1d_6", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_3"}, "name": "leaky_re_lu_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "center": true, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_4", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": -1, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_4", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_4"}, "name": "leaky_re_lu_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "trainable": true, "name": "dropout_1", "rate": 0.3}, "name": "dropout_1", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "config": {"padding": "same", "data_format": "channels_last", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1], "depthwise_regularizer": null, "depthwise_constraint": null, "trainable": true, "name": "separable_conv1d_7", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_regularizer": null, "kernel_size": [16], "dilation_rate": [1], "bias_regularizer": null, "activation": "linear", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "pointwise_constraint": null, "bias_constraint": null}, "name": "separable_conv1d_7", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "config": {"padding": "same", "data_format": "channels_last", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1], "depthwise_regularizer": null, "depthwise_constraint": null, "trainable": true, "name": "separable_conv1d_8", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_regularizer": null, "kernel_size": [32], "dilation_rate": [1], "bias_regularizer": null, "activation": "linear", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "pointwise_constraint": null, "bias_constraint": null}, "name": "separable_conv1d_8", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 2, "trainable": true, "name": "concatenate_3"}, "name": "concatenate_3", "inbound_nodes": [[["separable_conv1d_7", 0, 0, {}], ["separable_conv1d_8", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "config": {"padding": "same", "data_format": "channels_last", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1], "depthwise_regularizer": null, "depthwise_constraint": null, "trainable": true, "name": "separable_conv1d_9", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_regularizer": null, "kernel_size": [1], "dilation_rate": [1], "bias_regularizer": null, "activation": "linear", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "pointwise_constraint": null, "bias_constraint": null}, "name": "separable_conv1d_9", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "center": true, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_5", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": -1, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_5", "inbound_nodes": [[["separable_conv1d_9", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "data_format": "channels_last", "strides": [1], "pool_size": [1], "trainable": true, "name": "max_pooling1d_1"}, "name": "max_pooling1d_1", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_5"}, "name": "leaky_re_lu_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_1"}, "name": "add_1", "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}], ["leaky_re_lu_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "center": true, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_6", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": -1, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_6", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_6"}, "name": "leaky_re_lu_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "config": {"padding": "same", "data_format": "channels_last", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [2], "depthwise_regularizer": null, "depthwise_constraint": null, "trainable": true, "name": "separable_conv1d_10", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_regularizer": null, "kernel_size": [16], "dilation_rate": [1], "bias_regularizer": null, "activation": "linear", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "pointwise_constraint": null, "bias_constraint": null}, "name": "separable_conv1d_10", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "config": {"padding": "same", "data_format": "channels_last", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [2], "depthwise_regularizer": null, "depthwise_constraint": null, "trainable": true, "name": "separable_conv1d_11", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_regularizer": null, "kernel_size": [32], "dilation_rate": [1], "bias_regularizer": null, "activation": "linear", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "pointwise_constraint": null, "bias_constraint": null}, "name": "separable_conv1d_11", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 2, "trainable": true, "name": "concatenate_4"}, "name": "concatenate_4", "inbound_nodes": [[["separable_conv1d_10", 0, 0, {}], ["separable_conv1d_11", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "config": {"padding": "same", "data_format": "channels_last", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1], "depthwise_regularizer": null, "depthwise_constraint": null, "trainable": true, "name": "separable_conv1d_12", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_regularizer": null, "kernel_size": [2], "dilation_rate": [1], "bias_regularizer": null, "activation": "linear", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "pointwise_constraint": null, "bias_constraint": null}, "name": "separable_conv1d_12", "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "center": true, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_7", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": -1, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_7", "inbound_nodes": [[["separable_conv1d_12", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_7"}, "name": "leaky_re_lu_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "center": true, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_8", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": -1, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_8", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_8"}, "name": "leaky_re_lu_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "trainable": true, "name": "dropout_2", "rate": 0.3}, "name": "dropout_2", "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "config": {"padding": "same", "data_format": "channels_last", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1], "depthwise_regularizer": null, "depthwise_constraint": null, "trainable": true, "name": "separable_conv1d_13", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_regularizer": null, "kernel_size": [16], "dilation_rate": [1], "bias_regularizer": null, "activation": "linear", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "pointwise_constraint": null, "bias_constraint": null}, "name": "separable_conv1d_13", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "config": {"padding": "same", "data_format": "channels_last", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1], "depthwise_regularizer": null, "depthwise_constraint": null, "trainable": true, "name": "separable_conv1d_14", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_regularizer": null, "kernel_size": [32], "dilation_rate": [1], "bias_regularizer": null, "activation": "linear", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "pointwise_constraint": null, "bias_constraint": null}, "name": "separable_conv1d_14", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 2, "trainable": true, "name": "concatenate_5"}, "name": "concatenate_5", "inbound_nodes": [[["separable_conv1d_13", 0, 0, {}], ["separable_conv1d_14", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "config": {"padding": "same", "data_format": "channels_last", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1], "depthwise_regularizer": null, "depthwise_constraint": null, "trainable": true, "name": "separable_conv1d_15", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_regularizer": null, "kernel_size": [1], "dilation_rate": [1], "bias_regularizer": null, "activation": "linear", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "pointwise_constraint": null, "bias_constraint": null}, "name": "separable_conv1d_15", "inbound_nodes": [[["concatenate_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "center": true, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_9", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": -1, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_9", "inbound_nodes": [[["separable_conv1d_15", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "data_format": "channels_last", "strides": [2], "pool_size": [2], "trainable": true, "name": "max_pooling1d_2"}, "name": "max_pooling1d_2", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_9"}, "name": "leaky_re_lu_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_2"}, "name": "add_2", "inbound_nodes": [[["max_pooling1d_2", 0, 0, {}], ["leaky_re_lu_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "center": true, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_10", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": -1, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_10", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_10"}, "name": "leaky_re_lu_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "config": {"padding": "same", "data_format": "channels_last", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1], "depthwise_regularizer": null, "depthwise_constraint": null, "trainable": true, "name": "separable_conv1d_16", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_regularizer": null, "kernel_size": [16], "dilation_rate": [1], "bias_regularizer": null, "activation": "linear", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "pointwise_constraint": null, "bias_constraint": null}, "name": "separable_conv1d_16", "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "config": {"padding": "same", "data_format": "channels_last", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1], "depthwise_regularizer": null, "depthwise_constraint": null, "trainable": true, "name": "separable_conv1d_17", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_regularizer": null, "kernel_size": [32], "dilation_rate": [1], "bias_regularizer": null, "activation": "linear", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "pointwise_constraint": null, "bias_constraint": null}, "name": "separable_conv1d_17", "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 2, "trainable": true, "name": "concatenate_6"}, "name": "concatenate_6", "inbound_nodes": [[["separable_conv1d_16", 0, 0, {}], ["separable_conv1d_17", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "config": {"padding": "same", "data_format": "channels_last", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1], "depthwise_regularizer": null, "depthwise_constraint": null, "trainable": true, "name": "separable_conv1d_18", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_regularizer": null, "kernel_size": [1], "dilation_rate": [1], "bias_regularizer": null, "activation": "linear", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "pointwise_constraint": null, "bias_constraint": null}, "name": "separable_conv1d_18", "inbound_nodes": [[["concatenate_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "center": true, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_11", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": -1, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_11", "inbound_nodes": [[["separable_conv1d_18", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_11"}, "name": "leaky_re_lu_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "center": true, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_12", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": -1, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_12", "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_12"}, "name": "leaky_re_lu_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "trainable": true, "name": "dropout_3", "rate": 0.3}, "name": "dropout_3", "inbound_nodes": [[["leaky_re_lu_12", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "config": {"padding": "same", "data_format": "channels_last", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1], "depthwise_regularizer": null, "depthwise_constraint": null, "trainable": true, "name": "separable_conv1d_19", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_regularizer": null, "kernel_size": [16], "dilation_rate": [1], "bias_regularizer": null, "activation": "linear", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "pointwise_constraint": null, "bias_constraint": null}, "name": "separable_conv1d_19", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "config": {"padding": "same", "data_format": "channels_last", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1], "depthwise_regularizer": null, "depthwise_constraint": null, "trainable": true, "name": "separable_conv1d_20", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_regularizer": null, "kernel_size": [32], "dilation_rate": [1], "bias_regularizer": null, "activation": "linear", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "pointwise_constraint": null, "bias_constraint": null}, "name": "separable_conv1d_20", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 2, "trainable": true, "name": "concatenate_7"}, "name": "concatenate_7", "inbound_nodes": [[["separable_conv1d_19", 0, 0, {}], ["separable_conv1d_20", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "config": {"padding": "same", "data_format": "channels_last", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1], "depthwise_regularizer": null, "depthwise_constraint": null, "trainable": true, "name": "separable_conv1d_21", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_regularizer": null, "kernel_size": [1], "dilation_rate": [1], "bias_regularizer": null, "activation": "linear", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "pointwise_constraint": null, "bias_constraint": null}, "name": "separable_conv1d_21", "inbound_nodes": [[["concatenate_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "center": true, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_13", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": -1, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_13", "inbound_nodes": [[["separable_conv1d_21", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "data_format": "channels_last", "strides": [1], "pool_size": [1], "trainable": true, "name": "max_pooling1d_3"}, "name": "max_pooling1d_3", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_13"}, "name": "leaky_re_lu_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_3"}, "name": "add_3", "inbound_nodes": [[["max_pooling1d_3", 0, 0, {}], ["leaky_re_lu_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "center": true, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_14", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": -1, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_14", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_14"}, "name": "leaky_re_lu_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "config": {"padding": "same", "data_format": "channels_last", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [2], "depthwise_regularizer": null, "depthwise_constraint": null, "trainable": true, "name": "separable_conv1d_22", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_regularizer": null, "kernel_size": [16], "dilation_rate": [1], "bias_regularizer": null, "activation": "linear", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "pointwise_constraint": null, "bias_constraint": null}, "name": "separable_conv1d_22", "inbound_nodes": [[["leaky_re_lu_14", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "config": {"padding": "same", "data_format": "channels_last", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [2], "depthwise_regularizer": null, "depthwise_constraint": null, "trainable": true, "name": "separable_conv1d_23", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_regularizer": null, "kernel_size": [32], "dilation_rate": [1], "bias_regularizer": null, "activation": "linear", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "pointwise_constraint": null, "bias_constraint": null}, "name": "separable_conv1d_23", "inbound_nodes": [[["leaky_re_lu_14", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 2, "trainable": true, "name": "concatenate_8"}, "name": "concatenate_8", "inbound_nodes": [[["separable_conv1d_22", 0, 0, {}], ["separable_conv1d_23", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "config": {"padding": "same", "data_format": "channels_last", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1], "depthwise_regularizer": null, "depthwise_constraint": null, "trainable": true, "name": "separable_conv1d_24", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_regularizer": null, "kernel_size": [2], "dilation_rate": [1], "bias_regularizer": null, "activation": "linear", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "pointwise_constraint": null, "bias_constraint": null}, "name": "separable_conv1d_24", "inbound_nodes": [[["concatenate_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "center": true, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_15", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": -1, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_15", "inbound_nodes": [[["separable_conv1d_24", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_15"}, "name": "leaky_re_lu_15", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "center": true, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_16", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": -1, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_16", "inbound_nodes": [[["leaky_re_lu_15", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_16"}, "name": "leaky_re_lu_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "trainable": true, "name": "dropout_4", "rate": 0.3}, "name": "dropout_4", "inbound_nodes": [[["leaky_re_lu_16", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "config": {"padding": "same", "data_format": "channels_last", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1], "depthwise_regularizer": null, "depthwise_constraint": null, "trainable": true, "name": "separable_conv1d_25", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_regularizer": null, "kernel_size": [16], "dilation_rate": [1], "bias_regularizer": null, "activation": "linear", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "pointwise_constraint": null, "bias_constraint": null}, "name": "separable_conv1d_25", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "config": {"padding": "same", "data_format": "channels_last", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1], "depthwise_regularizer": null, "depthwise_constraint": null, "trainable": true, "name": "separable_conv1d_26", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_regularizer": null, "kernel_size": [32], "dilation_rate": [1], "bias_regularizer": null, "activation": "linear", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "pointwise_constraint": null, "bias_constraint": null}, "name": "separable_conv1d_26", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 2, "trainable": true, "name": "concatenate_9"}, "name": "concatenate_9", "inbound_nodes": [[["separable_conv1d_25", 0, 0, {}], ["separable_conv1d_26", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "config": {"padding": "same", "data_format": "channels_last", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1], "depthwise_regularizer": null, "depthwise_constraint": null, "trainable": true, "name": "separable_conv1d_27", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_regularizer": null, "kernel_size": [1], "dilation_rate": [1], "bias_regularizer": null, "activation": "linear", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "pointwise_constraint": null, "bias_constraint": null}, "name": "separable_conv1d_27", "inbound_nodes": [[["concatenate_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "center": true, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_17", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": -1, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_17", "inbound_nodes": [[["separable_conv1d_27", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "data_format": "channels_last", "strides": [2], "pool_size": [2], "trainable": true, "name": "max_pooling1d_4"}, "name": "max_pooling1d_4", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_17"}, "name": "leaky_re_lu_17", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_4"}, "name": "add_4", "inbound_nodes": [[["max_pooling1d_4", 0, 0, {}], ["leaky_re_lu_17", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "center": true, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_18", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": -1, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_18", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_18"}, "name": "leaky_re_lu_18", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "config": {"padding": "same", "data_format": "channels_last", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1], "depthwise_regularizer": null, "depthwise_constraint": null, "trainable": true, "name": "separable_conv1d_28", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_regularizer": null, "kernel_size": [16], "dilation_rate": [1], "bias_regularizer": null, "activation": "linear", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "pointwise_constraint": null, "bias_constraint": null}, "name": "separable_conv1d_28", "inbound_nodes": [[["leaky_re_lu_18", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "config": {"padding": "same", "data_format": "channels_last", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1], "depthwise_regularizer": null, "depthwise_constraint": null, "trainable": true, "name": "separable_conv1d_29", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_regularizer": null, "kernel_size": [32], "dilation_rate": [1], "bias_regularizer": null, "activation": "linear", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "pointwise_constraint": null, "bias_constraint": null}, "name": "separable_conv1d_29", "inbound_nodes": [[["leaky_re_lu_18", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 2, "trainable": true, "name": "concatenate_10"}, "name": "concatenate_10", "inbound_nodes": [[["separable_conv1d_28", 0, 0, {}], ["separable_conv1d_29", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "config": {"padding": "same", "data_format": "channels_last", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1], "depthwise_regularizer": null, "depthwise_constraint": null, "trainable": true, "name": "separable_conv1d_30", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_regularizer": null, "kernel_size": [1], "dilation_rate": [1], "bias_regularizer": null, "activation": "linear", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "pointwise_constraint": null, "bias_constraint": null}, "name": "separable_conv1d_30", "inbound_nodes": [[["concatenate_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "center": true, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_19", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": -1, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_19", "inbound_nodes": [[["separable_conv1d_30", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_19"}, "name": "leaky_re_lu_19", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "center": true, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_20", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": -1, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_20", "inbound_nodes": [[["leaky_re_lu_19", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_20"}, "name": "leaky_re_lu_20", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "trainable": true, "name": "dropout_5", "rate": 0.3}, "name": "dropout_5", "inbound_nodes": [[["leaky_re_lu_20", 0, 0, {}]]]}, {"class_name": "SeparableConv1D", "config": {"padding": "same", "data_format": "channels_last", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1], "depthwise_regularizer": null, "depthwise_constraint": null, "trainable": true, "name": "separable_conv1d_31", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_regularizer": null, "kernel_size": [16], "dilation_rate": [1], "bias_regularizer": null, "activation": "linear", "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "pointwise_constraint": null, "bias_constraint": null}, "name": "separable_conv1d_31", "inbound_nodes": 